Revit 2027 API
LevelAssociationData.SetAssociatedLevel Method
 Sets the Associated Level.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetAssociatedLevel(
	ElementId levelId
)
Public Sub SetAssociatedLevel (
	levelId As ElementId
)
public:
void SetAssociatedLevel(
	ElementId^ levelId
)
member SetAssociatedLevel :
        levelId : ElementId -> unit
Parameters
levelId ElementId
 The id of the Level.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  this operation failed.
See Also
Reference
LevelAssociationData Class
Autodesk.Revit.DB Namespace